Model: "sequential_32"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_31 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_135 (Dense)            (None, 450)               58050     
_________________________________________________________________
dense_136 (Dense)            (None, 220)               99220     
_________________________________________________________________
dense_137 (Dense)            (None, 110)               24310     
_________________________________________________________________
dense_138 (Dense)            (None, 50)                5550      
_________________________________________________________________
dense_139 (Dense)            (None, 20)                1020      
_________________________________________________________________
dense_140 (Dense)            (None, 10)                210       
=================================================================
Total params: 188,776
Trainable params: 188,776
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 50.3%Model: "sequential_33"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_32 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_141 (Dense)            (None, 450)               58050     
_________________________________________________________________
dense_142 (Dense)            (None, 220)               99220     
_________________________________________________________________
dense_143 (Dense)            (None, 110)               24310     
_________________________________________________________________
dense_144 (Dense)            (None, 50)                5550      
_________________________________________________________________
dense_145 (Dense)            (None, 20)                1020      
_________________________________________________________________
dense_146 (Dense)            (None, 10)                210       
=================================================================
Total params: 188,776
Trainable params: 188,776
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 92.2%Model: "sequential_34"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_33 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_147 (Dense)            (None, 450)               58050     
_________________________________________________________________
dense_148 (Dense)            (None, 220)               99220     
_________________________________________________________________
dense_149 (Dense)            (None, 110)               24310     
_________________________________________________________________
dense_150 (Dense)            (None, 50)                5550      
_________________________________________________________________
dense_151 (Dense)            (None, 20)                1020      
_________________________________________________________________
dense_152 (Dense)            (None, 10)                210       
=================================================================
Total params: 188,776
Trainable params: 188,776
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 98.0%Model: "sequential_35"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_34 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 28, 28, 32)        4128      
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 5, 5, 32)          0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 800)               0         
_________________________________________________________________
dense_153 (Dense)            (None, 220)               176220    
_________________________________________________________________
dense_154 (Dense)            (None, 50)                11050     
_________________________________________________________________
dense_155 (Dense)            (None, 10)                510       
=================================================================
Total params: 192,324
Trainable params: 192,324
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 98.1%Model: "sequential_36"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_36 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 28, 28, 32)        4128      
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 5, 5, 32)          0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 800)               0         
_________________________________________________________________
dense_156 (Dense)            (None, 220)               176220    
_________________________________________________________________
dense_157 (Dense)            (None, 50)                11050     
_________________________________________________________________
dense_158 (Dense)            (None, 10)                510       
=================================================================
Total params: 192,324
Trainable params: 192,324
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : Model: "sequential_44"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_61 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_25 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_177 (Dense)            (None, 450)               58050     
_________________________________________________________________
dense_178 (Dense)            (None, 220)               99220     
_________________________________________________________________
dense_179 (Dense)            (None, 110)               24310     
_________________________________________________________________
dense_180 (Dense)            (None, 50)                5550      
_________________________________________________________________
dense_181 (Dense)            (None, 20)                1020      
_________________________________________________________________
dense_182 (Dense)            (None, 10)                210       
=================================================================
Total params: 188,776
Trainable params: 188,776
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 48.7%Model: "sequential_45"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_62 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_26 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_183 (Dense)            (None, 450)               58050     
_________________________________________________________________
dense_184 (Dense)            (None, 220)               99220     
_________________________________________________________________
dense_185 (Dense)            (None, 110)               24310     
_________________________________________________________________
dense_186 (Dense)            (None, 50)                5550      
_________________________________________________________________
dense_187 (Dense)            (None, 20)                1020      
_________________________________________________________________
dense_188 (Dense)            (None, 10)                210       
=================================================================
Total params: 188,776
Trainable params: 188,776
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 91.9%Model: "sequential_46"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_63 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_27 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_189 (Dense)            (None, 450)               58050     
_________________________________________________________________
dense_190 (Dense)            (None, 220)               99220     
_________________________________________________________________
dense_191 (Dense)            (None, 110)               24310     
_________________________________________________________________
dense_192 (Dense)            (None, 50)                5550      
_________________________________________________________________
dense_193 (Dense)            (None, 20)                1020      
_________________________________________________________________
dense_194 (Dense)            (None, 10)                210       
=================================================================
Total params: 188,776
Trainable params: 188,776
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 98.0%Model: "sequential_47"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_64 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
conv2d_65 (Conv2D)           (None, 28, 28, 32)        4128      
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 5, 5, 32)          0         
_________________________________________________________________
flatten_28 (Flatten)         (None, 800)               0         
_________________________________________________________________
dense_195 (Dense)            (None, 220)               176220    
_________________________________________________________________
dense_196 (Dense)            (None, 50)                11050     
_________________________________________________________________
dense_197 (Dense)            (None, 10)                510       
=================================================================
Total params: 192,324
Trainable params: 192,324
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 97.8%Model: "sequential_48"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_66 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
conv2d_67 (Conv2D)           (None, 28, 28, 32)        4128      
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 5, 5, 32)          0         
_________________________________________________________________
flatten_29 (Flatten)         (None, 800)               0         
_________________________________________________________________
dense_198 (Dense)            (None, 220)               176220    
_________________________________________________________________
dense_199 (Dense)            (None, 50)                11050     
_________________________________________________________________
dense_200 (Dense)            (None, 10)                510       
=================================================================
Total params: 192,324
Trainable params: 192,324
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 