Model: "sequential_58"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_93 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_39 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_231 (Dense)            (None, 450)               58050     
_________________________________________________________________
dense_232 (Dense)            (None, 220)               99220     
_________________________________________________________________
dense_233 (Dense)            (None, 110)               24310     
_________________________________________________________________
dense_234 (Dense)            (None, 50)                5550      
_________________________________________________________________
dense_235 (Dense)            (None, 20)                1020      
_________________________________________________________________
dense_236 (Dense)            (None, 10)                210       
=================================================================
Total params: 188,776
Trainable params: 188,776
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 49.5%Model: "sequential_61"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_98 (Conv2D)           (None, 29, 29, 32)        416       
_________________________________________________________________
conv2d_99 (Conv2D)           (None, 28, 28, 32)        4128      
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 5, 5, 32)          0         
_________________________________________________________________
flatten_42 (Flatten)         (None, 800)               0         
_________________________________________________________________
dense_243 (Dense)            (None, 220)               176220    
_________________________________________________________________
dense_244 (Dense)            (None, 50)                11050     
_________________________________________________________________
dense_245 (Dense)            (None, 10)                510       
=================================================================
Total params: 192,324
Trainable params: 192,324
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 90.8%Model: "sequential_64"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_106 (Conv2D)          (None, 29, 29, 32)        416       
_________________________________________________________________
conv2d_107 (Conv2D)          (None, 28, 28, 32)        4128      
_________________________________________________________________
conv2d_108 (Conv2D)          (None, 27, 27, 32)        4128      
_________________________________________________________________
max_pooling2d_45 (MaxPooling (None, 13, 13, 32)        0         
_________________________________________________________________
flatten_45 (Flatten)         (None, 5408)              0         
_________________________________________________________________
dense_252 (Dense)            (None, 180)               973620    
_________________________________________________________________
dense_253 (Dense)            (None, 30)                5430      
_________________________________________________________________
dense_254 (Dense)            (None, 10)                310       
=================================================================
Total params: 988,032
Trainable params: 988,032
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 98.8%Model: "sequential_67"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_117 (Conv2D)          (None, 29, 29, 32)        416       
_________________________________________________________________
conv2d_118 (Conv2D)          (None, 28, 28, 32)        4128      
_________________________________________________________________
conv2d_119 (Conv2D)          (None, 27, 27, 32)        4128      
_________________________________________________________________
conv2d_120 (Conv2D)          (None, 26, 26, 32)        4128      
_________________________________________________________________
max_pooling2d_48 (MaxPooling (None, 13, 13, 32)        0         
_________________________________________________________________
flatten_48 (Flatten)         (None, 5408)              0         
_________________________________________________________________
dense_259 (Dense)            (None, 100)               540900    
_________________________________________________________________
dense_260 (Dense)            (None, 10)                1010      
=================================================================
Total params: 554,710
Trainable params: 554,710
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 98.5%