Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_6 (Dense)              (None, 450)               405450    
_________________________________________________________________
dense_7 (Dense)              (None, 220)               99220     
_________________________________________________________________
dense_8 (Dense)              (None, 110)               24310     
_________________________________________________________________
dense_9 (Dense)              (None, 50)                5550      
_________________________________________________________________
dense_10 (Dense)             (None, 20)                1020      
_________________________________________________________________
dense_11 (Dense)             (None, 10)                210       
=================================================================
Total params: 535,760
Trainable params: 535,760
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 42.5%Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_12 (Dense)             (None, 450)               405450    
_________________________________________________________________
dense_13 (Dense)             (None, 220)               99220     
_________________________________________________________________
dense_14 (Dense)             (None, 110)               24310     
_________________________________________________________________
dense_15 (Dense)             (None, 50)                5550      
_________________________________________________________________
dense_16 (Dense)             (None, 20)                1020      
_________________________________________________________________
dense_17 (Dense)             (None, 10)                210       
=================================================================
Total params: 535,760
Trainable params: 535,760
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 50.0%Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_18 (Dense)             (None, 450)               405450    
_________________________________________________________________
dense_19 (Dense)             (None, 220)               99220     
_________________________________________________________________
dense_20 (Dense)             (None, 110)               24310     
_________________________________________________________________
dense_21 (Dense)             (None, 50)                5550      
_________________________________________________________________
dense_22 (Dense)             (None, 20)                1020      
_________________________________________________________________
dense_23 (Dense)             (None, 10)                210       
=================================================================
Total params: 535,760
Trainable params: 535,760
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_33 (Dense)             (None, 450)               405450    
_________________________________________________________________
dense_34 (Dense)             (None, 220)               99220     
_________________________________________________________________
dense_35 (Dense)             (None, 110)               24310     
_________________________________________________________________
dense_36 (Dense)             (None, 50)                5550      
_________________________________________________________________
dense_37 (Dense)             (None, 20)                1020      
_________________________________________________________________
dense_38 (Dense)             (None, 10)                210       
=================================================================
Total params: 535,760
Trainable params: 535,760
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 32.3%Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_39 (Dense)             (None, 450)               405450    
_________________________________________________________________
dense_40 (Dense)             (None, 220)               99220     
_________________________________________________________________
dense_41 (Dense)             (None, 110)               24310     
_________________________________________________________________
dense_42 (Dense)             (None, 50)                5550      
_________________________________________________________________
dense_43 (Dense)             (None, 20)                1020      
_________________________________________________________________
dense_44 (Dense)             (None, 10)                210       
=================================================================
Total params: 535,760
Trainable params: 535,760
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 60.6%Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_45 (Dense)             (None, 450)               405450    
_________________________________________________________________
dense_46 (Dense)             (None, 220)               99220     
_________________________________________________________________
dense_47 (Dense)             (None, 110)               24310     
_________________________________________________________________
dense_48 (Dense)             (None, 50)                5550      
_________________________________________________________________
dense_49 (Dense)             (None, 20)                1020      
_________________________________________________________________
dense_50 (Dense)             (None, 10)                210       
=================================================================
Total params: 535,760
Trainable params: 535,760
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 