Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_72 (Dense)             (None, 450)               405450    
_________________________________________________________________
dense_73 (Dense)             (None, 220)               99220     
_________________________________________________________________
dense_74 (Dense)             (None, 110)               24310     
_________________________________________________________________
dense_75 (Dense)             (None, 50)                5550      
_________________________________________________________________
dense_76 (Dense)             (None, 20)                1020      
_________________________________________________________________
dense_77 (Dense)             (None, 10)                210       
=================================================================
Total params: 535,760
Trainable params: 535,760
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 38.9%Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_84 (Dense)             (None, 220)               198220    
_________________________________________________________________
dense_85 (Dense)             (None, 50)                11050     
_________________________________________________________________
dense_86 (Dense)             (None, 10)                510       
=================================================================
Total params: 209,780
Trainable params: 209,780
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 44.0%