Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_120 (Dense)            (None, 450)               405450    
_________________________________________________________________
dense_121 (Dense)            (None, 220)               99220     
_________________________________________________________________
dense_122 (Dense)            (None, 110)               24310     
_________________________________________________________________
dense_123 (Dense)            (None, 50)                5550      
_________________________________________________________________
dense_124 (Dense)            (None, 20)                1020      
_________________________________________________________________
dense_125 (Dense)            (None, 10)                210       
=================================================================
Total params: 535,760
Trainable params: 535,760
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 50.8%Model: "sequential_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_132 (Dense)            (None, 220)               198220    
_________________________________________________________________
dense_133 (Dense)            (None, 50)                11050     
_________________________________________________________________
dense_134 (Dense)            (None, 10)                510       
=================================================================
Total params: 209,780
Trainable params: 209,780
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 62.7%Model: "sequential_26"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_141 (Dense)            (None, 180)               162180    
_________________________________________________________________
dense_142 (Dense)            (None, 30)                5430      
_________________________________________________________________
dense_143 (Dense)            (None, 10)                310       
=================================================================
Total params: 167,920
Trainable params: 167,920
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 20.0%Model: "sequential_29"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_148 (Dense)            (None, 100)               90100     
_________________________________________________________________
dense_149 (Dense)            (None, 10)                1010      
=================================================================
Total params: 91,110
Trainable params: 91,110
Non-trainable params: 0
_________________________________________________________________
Train Accuracy : 64.5%